app/Controllers/Home.php

    public function login()
    {
        $userModel = new c_utilisateur();
        $passageuser = new PassageUserModel();
        $cs_struct = new cs_struct();
        $ca_acteur = new ca_acteur();
        $email = $this->request->getPost("email");
        $password = $this->request->getVar("mdp_1");
        $user = $userModel->where('email', $email)->first();

        if (!empty($user)) {
            $session = session();
            if (password_verify($password, $user["mdp_1"])) {
                if ($user["id_utilisateur_categorie"] == 2) {
                    $userStruct = $cs_struct->where('cs_struct.id_utilisateur', intval($user["id"]))->first();
---
SELECT *
FROM `cs_struct`
WHERE `cs_struct`.`id_utilisateur` = 7
 LIMIT 1