app/Controllers/Inscription.php

SELECT *
FROM `cs_thematique`
WHERE `etat` = 1
ORDER BY `nom` ASC
---
    public function inscriptionStructureThematique()
    {
        $session_utilisateur = $this->session->get('utilisateur_inscription');
        if (empty($session_utilisateur)) {
            return redirect()->to('/connexion');
        }
        $cs_thematique = new cs_thematique();
        $data['cs_thematiques'] = $cs_thematique->orderBy("nom", "asc")->where('etat =', 1)->find();

SELECT *
FROM `cs_public`
---
    public function inscriptionStructurePublic()
    {
        $session_utilisateur = $this->session->get('utilisateur_inscription');
        if (empty($session_utilisateur)) {
            return redirect()->to('/connexion');
        }
        $cs_public = new cs_public();
        $data['cs_publics'] = $cs_public->find();

SELECT *
FROM `cs_particularite_action`
WHERE `etat` = 1
ORDER BY `nom` ASC
---
    public function inscriptionStructureParticulariteAction()
    {
        $session_utilisateur = $this->session->get('utilisateur_inscription');
        if (empty($session_utilisateur)) {
            return redirect()->to('/connexion');
        }
        $cs_particularite_action = new cs_particularite_action();
        $data['cs_particularite_actions'] = $cs_particularite_action->orderBy("nom", "asc")->where('etat =', 1)->find();

SELECT *
FROM `cs_territoire`
---
    public function inscriptionStructureZone()
    {
        $session_utilisateur = $this->session->get('utilisateur_inscription');
        if (empty($session_utilisateur)) {
            return redirect()->to('/connexion');
        }
        $cs_territoire = new cs_territoire();
        $data['cs_territoires'] = $cs_territoire->find();

SELECT *
FROM `cs_modalite`
WHERE `etat` = 1
---
    public function inscriptionStructureModalitePublic()
    {
        $session_utilisateur = $this->session->get('utilisateur_inscription');
        if (empty($session_utilisateur)) {
            return redirect()->to('/connexion');
        }
        $cs_modalite = new cs_modalite();
        $data['cs_modalites'] = $cs_modalite->where('etat =', 1)->find();

INSERT INTO `c_utilisateur_files` (`id_utilisateur`, `nom_file`)
VALUES (7,'1689160611_f174159c6aa81a581d10.pdf')
---
                                    ]
                                );
                                $file->move('./uploads', $newName);
                                $c_utilisateur_files->insertBatch($data);

INSERT INTO `cs_struct` (`id_utilisateur`, `nom_social`, `sigle`, `siren`, `adresse_siege`, `adresse_principale`, `tel_siege`, `email_siege`, `desc_horaire_ouverture`) VALUES (7, 'Guillaume Theo', 'Sigle', '457862455', 'Saint-Georges-d\'Espéranche, 38, Isère, Auvergne-Rhône-Alpes, Route du TGV', '05 Bis Aller Des Sagoutier', '06 93 61 01 89', 'guysolofo.harinaina@gmail.com', '')
INSERT INTO `cs_jour_horaire` (`id_utilisateur`, `id_rang`, `matin`, `midi`, `soir`) VALUES (7, 0, NULL, NULL, NULL)
INSERT INTO `cs_jour_horaire` (`id_utilisateur`, `id_rang`, `matin`, `midi`, `soir`) VALUES (7, 3, 'matin', NULL, NULL)
---
                        }
                    }
                    if (!empty($valid)) {
                        $insertStruct = $cs_struct->insert($session_structure);
                        if (!empty($insertStruct)) {
                            if (!empty($session_struct_horraire_semaine)) {
                                $cs_jour_horaire->insert($session_struct_horraire_semaine);
                            }
                            if (!empty($session_struct_horraire_weekend)) {
                                $cs_jour_horaire->insert($session_struct_horraire_weekend);

INSERT INTO `cs_antenne_jour_horaire` (`id_utilisateur`, `id_rang`, `matin`, `midi`, `soir`) VALUES (7, 1, 'matin', 'midi', NULL)
---
                            }
                            //insert antenne jour horraire
                            if (!empty($session_antenne_horraire_semaine)) {
                                $cs_antenne_jour_horaire->insert($session_antenne_horraire_semaine);

INSERT INTO `cs_referent` (`id_utilisateur`, `fonction`, `nom`, `prenom`, `email`) VALUES (7, 'Developpeur', 'Guy', 'Harin\'aina', 'guillaumetheo92@gmail.com')
---

                            //session referent
                            if (!empty($session_referent)) {
                                $cs_referent->insert($session_referent);

UPDATE `cs_struct` SET `id_utilisateur` = '7', `id_categorie` = 6, `nom_social` = 'Guillaume Theo', `sigle` = 'Sigle', `siren` = '457862455', `adresse_siege` = 'Saint-Georges-d\'Espéranche, 38, Isère, Auvergne-Rh', `adresse_principale` = '05 Bis Aller Des Sagoutier', `email_siege` = 'guysolofo.harinaina@gmail.com', `tel_siege` = '06 93 61 01 89', `site_web` = NULL, `desc_horaire_ouverture` = '', `desc_mission` = '', `exemples_action` = '', `photo_logo` = '1689160611_de9520231f27e2c1b727.jpg', `date_ins` = '2023-07-12 14:16:51', `etat` = '0'
WHERE `cs_struct`.`id` IN ('3')
---
                            $structure['desc_mission'] = $session_desc_mission;
                            $structure['exemples_action'] = $session_exemples_action;
                            $file_logo->move('./upload', $randomName);
                            $cs_struct->update($structure['id'], $structure);

INSERT INTO `c_utilisateur_champ_action` (`id_champ_action`, `id_utilisateur`)
VALUES (2,7)
---
                        }
                        if (!empty($validChampAction)) {
                            foreach ($session_champ_action as $champs_action) {
                                $c_utilisateur_champ_action->insertBatch($champs_action);

INSERT INTO `c_utilisateur_thematique` (`id_thematique`, `id_utilisateur`)
VALUES (14,7)
---
                        }
                        if (!empty($validthematique)) {
                            foreach ($session_thematiques as $thematique) {
                                $c_utilisateur_thematique->insertBatch($thematique);

INSERT INTO `c_utilisateur_public` (`id_public`, `id_utilisateur`)
VALUES ('5',7)
---
                        }
                        if (!empty($validPublic)) {
                            foreach ($session_publics as $public) {
                                $c_utilisateur_public->insertBatch($public);

INSERT INTO `c_utilisateur_particularite_action` (`id_particularite_action`, `id_utilisateur`)
VALUES (10,7)
---
                        }
                        if (!empty($validPartAction)) {
                            foreach ($session_particularite_action as $partAction) {
                                $c_utilisateur_particularite_action->insertBatch($partAction);

INSERT INTO `c_utilisateur_territoire` (`id_territoire`, `id_utilisateur`)
VALUES (1,7)
---
                        }
                        if (!empty($validZone)) {
                            foreach ($session_zone_territoire as $territoire) {
                                $c_utilisateur_territoire->insertBatch($territoire);

INSERT INTO `c_utilisateur_modalite` (`id_modalite`, `id_utilisateur`)
VALUES (4,7)
---
                        }
                        if (!empty($validModPublic)) {
                            foreach ($session_modalite_public as $modalPublic) {
                                $c_utilisateur_modalite->insertBatch($modalPublic);